src/InformationRegisters/Промокоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Промокоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Промокод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Промокоды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СоставСегментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СоставСегментов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыСотрудников</v8:Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.СегментыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСегмента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/Промокоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Промокоды</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Владельцы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаПромокода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реферальный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыСотрудников</v8:Type>
						<v8:Type>cfg:CatalogRef.СегментыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/Промокоды/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Функция, возвращает вид промокода по промокоду.
//
Функция ПолучитьВидПромокода(Промокод) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Промокоды.Вид КАК Вид
	|ИЗ
	|	РегистрСведений.Промокоды КАК Промокоды
	|ГДЕ
	|	Промокоды.Промокод = &Промокод
	|	И НЕ Промокоды.Вид.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("Промокод", Промокод);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Результат.Следующий(), Результат.Вид, Неопределено);

КонецФункции

// Функция, возвращает таблицу промокодов доступных клиенту.
//
Функция ПромокодыКонтрагента(ВладелецПромокода) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Промокоды.Вид КАК Вид,
	|	Промокоды.Промокод КАК Промокод,
	|	Промокоды.Владелец КАК Владелец,
	|	Промокоды.Вид.Наименование КАК Наименование
	|ИЗ
	|	РегистрСведений.Промокоды КАК Промокоды
	|ГДЕ
	|	Промокоды.Активен
	|	И Промокоды.Владелец <> &Владелец
	|	И НЕ Промокоды.Вид.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("Владелец", ВладелецПромокода);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция, возвращает таблицу промокодов доступных клиенту.
Функция ПолучитьПромокодыКлиентаДляРаспространения(Клиент) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Промокоды.Промокод КАК Промокод,
	|	Промокоды.Вид.Наименование КАК Наименование
	|ИЗ
	|	РегистрСведений.Промокоды КАК Промокоды
	|ГДЕ
	|	Промокоды.Активен
	|	И Промокоды.Владелец = &Владелец
	|	И НЕ Промокоды.Вид.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("Владелец", Клиент);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция, Возвращает представление промокодов клиента
//
Функция ПолучитьПредставленияПромокодовКлиента(Клиент) Экспорт
	
	Запрос       = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Промокоды.Промокод КАК Промокод,
	|	Промокоды.Вид КАК Вид
	|ПОМЕСТИТЬ ТаблицаПромокодов
	|ИЗ
	|	РегистрСведений.Промокоды КАК Промокоды
	|ГДЕ
	|	Промокоды.Владелец = &Владелец
	|	И Промокоды.Активен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПромокодов.Промокод КАК Промокод,
	|	ТаблицаПромокодов.Вид.Наименование КАК Наименование
	|ИЗ
	|	ТаблицаПромокодов КАК ТаблицаПромокодов
	|ГДЕ
	|	НЕ ТаблицаПромокодов.Вид.ПометкаУдаления";
	Запрос.УстановитьПараметр("Владелец", Клиент);  
	ВыборкаПромокода = Запрос.Выполнить().Выбрать();
	ПредставлениеПромокодов = "";
	Пока ВыборкаПромокода.Следующий() Цикл
		ПредставлениеПромокода = ВыборкаПромокода.Наименование + ": " + ВыборкаПромокода.Промокод;
		ПредставлениеПромокодов = ?(ПредставлениеПромокодов = "", ПредставлениеПромокода, ПредставлениеПромокодов + ", " + ПредставлениеПромокода);  
	КонецЦикла;	 
	
	Возврат ПредставлениеПромокодов;	
	
КонецФункции     

// Функция, Возвращает представление промокодов клиента
//
Функция ПолучитьАктивныйПромокод(Реферал) Экспорт
	
	Запрос       = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Промокоды.Промокод КАК Промокод	
	|ИЗ
	|	РегистрСведений.Промокоды КАК Промокоды
	|ГДЕ
	|	Промокоды.Владелец = &Владелец
	|	И Промокоды.Активен
	|	И Промокоды.Вид.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Владелец", Реферал);  
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Промокод, "");
		
КонецФункции


// Процедура, перезаписывает реферальные коды клиента.
//
Процедура ЗаписатьРеферальныеКоды(Владелец) Экспорт
	
	НаборЗаписей = РегистрыСведений.Промокоды.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Владелец.Установить(Владелец);
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Промокоды.Ссылка КАК Ссылка,
	|	Промокоды.ДлинаПромокода КАК ДлинаПромокода
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	Справочник.Промокоды КАК Промокоды
	|ГДЕ
	|	Промокоды.Реферальный
	|	И НЕ Промокоды.ПометкаУдаления
	|	И НЕ Промокоды.Владельцы
	|	И (Промокоды.Сегмент = НЕОПРЕДЕЛЕНО
	|			ИЛИ Промокоды.Сегмент = ЗНАЧЕНИЕ(Справочник.СегментыКонтрагентов.ПустаяСсылка)
	|			ИЛИ Промокоды.Сегмент = ЗНАЧЕНИЕ(Справочник.СегментыСотрудников.ПустаяСсылка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Промокоды.Ссылка,
	|	Промокоды.ДлинаПромокода
	|ИЗ
	|	Справочник.Промокоды КАК Промокоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоставСегментов КАК СоставСегментов
	|		ПО Промокоды.Сегмент = СоставСегментов.Сегмент
	|ГДЕ
	|	НЕ Промокоды.ПометкаУдаления
	|	И НЕ Промокоды.Владельцы
	|	И Промокоды.Реферальный
	|	И СоставСегментов.ОбъектСегмента.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВременнаяТаблица.Ссылка КАК Ссылка,
	|	ВременнаяТаблица.ДлинаПромокода КАК ДлинаПромокода
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|ГДЕ
	|	НЕ ВременнаяТаблица.Ссылка В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					Промокоды.Вид КАК Вид
	|				ИЗ
	|					РегистрСведений.Промокоды КАК Промокоды
	|				ГДЕ
	|					Промокоды.Владелец = &Ссылка)");
	
	Запрос.УстановитьПараметр("Ссылка", Владелец);
	
	ВидыПромокодов = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Промокоды.Промокод КАК Промокод
	|ИЗ
	|	РегистрСведений.Промокоды КАК Промокоды");
	
	СуществующиеПромокоды			 = Запрос.Выполнить().Выгрузить();
	КоличествоСуществующихПромокодов = СуществующиеПромокоды.Количество();
	
	ГСЧ = Новый ГенераторСлучайныхЧисел;
	
	НаборЗаписей.Прочитать();
	
	Для Каждого ВидПромокода Из ВидыПромокодов Цикл
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Активен	 = Истина;
		НоваяЗапись.Вид		 = ВидПромокода.Ссылка;
		НоваяЗапись.Владелец = Владелец;
		НоваяЗапись.Промокод = СгенерироватьПромокоды(ВидПромокода.ДлинаПромокода, ГСЧ, 1, СуществующиеПромокоды)[КоличествоСуществующихПромокодов].Промокод;
		
		КоличествоСуществующихПромокодов = КоличествоСуществующихПромокодов + 1;
		
	КонецЦикла;
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
	КонецПопытки;
	
КонецПроцедуры

// Функция, записывает реферальный код и возвращает промокод.
//
Функция ЗаписатьИПолучитьРеферальныйКод(Владелец, Вид) Экспорт
	
    СуществующиеПромокоды			 = Неопределено;
	КоличествоСуществующихПромокодов = Неопределено;
	ЗаполнитьСуществующиеПромокоды(СуществующиеПромокоды, КоличествоСуществующихПромокодов);
	
	ГСЧ = Новый ГенераторСлучайныхЧисел;

	Промокод = СгенерироватьПромокоды(Вид.ДлинаПромокода, ГСЧ, 1, СуществующиеПромокоды)[КоличествоСуществующихПромокодов].Промокод;
	
	НоваяЗапись = РегистрыСведений.Промокоды.СоздатьМенеджерЗаписи();
	НоваяЗапись.Активен	 = Истина;
	НоваяЗапись.Вид		 = Вид;
	НоваяЗапись.Владелец = Владелец;
	НоваяЗапись.Промокод = Промокод;
	НоваяЗапись.Записать();
	
	Возврат Промокод;
	
КонецФункции

// Процедура, заполняет таблиу существующими промокодами.
Процедура ЗаполнитьСуществующиеПромокоды(СуществующиеПромокоды, КоличествоСуществующихПромокодов)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Промокоды.Промокод КАК Промокод
	|ИЗ
	|	РегистрСведений.Промокоды КАК Промокоды");
	
	СуществующиеПромокоды			 = Запрос.Выполнить().Выгрузить();
	КоличествоСуществующихПромокодов = СуществующиеПромокоды.Количество();

КонецПроцедуры

// Функция, перезаписывает запись регистра.
//
Функция ИзменитьПромокод(ПараметрыДанных, ОписаниеОшибки = "") Экспорт
	
	ПромокодИзменен = Ложь;
	
	МенеджерЗаписи = РегистрыСведений.Промокоды.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыДанных);
		
	Попытка
		Если Не ПроверитьУникальностьПромокода(МенеджерЗаписи.Промокод, МенеджерЗаписи.Вид, МенеджерЗаписи.Владелец) Тогда
			ВызватьИсключение Нстр("ru = 'Введенный промокод уже существует!'; en = 'Promocode already exist!'");
		КонецЕсли;	
		МенеджерЗаписи.Записать();
		ПромокодИзменен = Истина;
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат ПромокодИзменен;
	
КонецФункции

// Функция - Удалить промокод контрагента.
//
Функция УдалитьПромокодКонтрагента(ПараметрыДанныхУдаления) Экспорт
	
	ПромокодУдален = Ложь;
	
	МенеджерЗаписи          = РегистрыСведений.Промокоды.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Вид 		= ПараметрыДанныхУдаления.Вид;
	МенеджерЗаписи.Владелец = ПараметрыДанныхУдаления.Владелец;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Удалить();
		ПромокодУдален = Истина;
	КонецЕсли;
	
	Возврат ПромокодУдален;
	
КонецФункции	

// Процедура, генерирует промокоды с контролем уникальности и записывает в регистр.
//
Процедура СгенерироватьИЗаписатьПромокоды(Знач ДлинаПромокода, Вид, МассивВладельцев) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Промокоды.Промокод КАК Промокод
	|ИЗ
	|	РегистрСведений.Промокоды КАК Промокоды");
	
	СуществующиеПромокоды			 = Запрос.Выполнить().Выгрузить();
	КоличествоСуществующихПромокодов = СуществующиеПромокоды.Количество();
	
	ГСЧ = Новый ГенераторСлучайныхЧисел;
	
	ТаблицаПромокодов = СгенерироватьПромокоды(?(ДлинаПромокода = 0, 10, ДлинаПромокода), ГСЧ, МассивВладельцев.Количество(), СуществующиеПромокоды);
	
	НаборЗаписей = РегистрыСведений.Промокоды.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Вид.Установить(Вид);
	
	Для Индекс = 0 ПО МассивВладельцев.ВГраница() Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Владелец = МассивВладельцев[Индекс];
		НоваяЗапись.Активен	 = Истина;
		НоваяЗапись.Вид		 = Вид;
		НоваяЗапись.Промокод = ТаблицаПромокодов[Индекс + КоличествоСуществующихПромокодов].Промокод;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Процедура, генерирует промокоды для объектов сегментов при формировании.
//
Процедура ЗаписатьПромокодыПоСегменту(Сегмент, НовыеОбъектыСегмента) Экспорт
	
	Если ТипЗнч(Сегмент) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоставСегмента.ОбъектСегмента КАК ОбъектСегмента
	|ПОМЕСТИТЬ СоставСегмента
	|ИЗ
	|	&СоставСегмента КАК СоставСегмента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Промокоды.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВидыПромокодов
	|ИЗ
	|	Справочник.Промокоды КАК Промокоды
	|ГДЕ
	|	Промокоды.Сегмент = &Сегмент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Промокоды.Ссылка КАК Вид,
	|	СоставСегмента.ОбъектСегмента КАК Владелец
	|ИЗ
	|	ВидыПромокодов КАК Промокоды,
	|	СоставСегмента КАК СоставСегмента");
	
	Запрос.УстановитьПараметр("Сегмент"			, Сегмент);
	Запрос.УстановитьПараметр("СоставСегмента"	, НовыеОбъектыСегмента);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	ГСЧ = Новый ГенераторСлучайныхЧисел;
	СуществующиеПромокоды = Неопределено;
	ЗаполнитьСуществующиеПромокоды(СуществующиеПромокоды, Неопределено);
	
	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи			= РегистрыСведений.Промокоды.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Вид		= Выборка.Вид;
		МенеджерЗаписи.Владелец = Выборка.Владелец;
		
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			Продолжить;
		КонецЕсли;
		
		Промокод = ПолучитьНовыйПромокод(Выборка.Вид.ДлинаПромокода, ГСЧ, СуществующиеПромокоды);
		
		СтрокаПромокода			 = СуществующиеПромокоды.Добавить();
		СтрокаПромокода.Промокод = Промокод;
		
		МенеджерЗаписи.Вид		= Выборка.Вид;
		МенеджерЗаписи.Владелец = Выборка.Владелец;
		МенеджерЗаписи.Промокод = Промокод;
		МенеджерЗаписи.Активен	= Истина;
		
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
		
КонецПроцедуры

// Функция, генерирует промокоды.
//
Функция СгенерироватьПромокоды(Знач ДлинаПромокода, ГСЧ, КоличествоПромокодов, СуществующиеПромокоды)
	
	ТребуемоеКоличествоПромокодов = КоличествоПромокодов + СуществующиеПромокоды.Количество();
	
	Для Индекс = 0 ПО КоличествоПромокодов - 1 Цикл
		
		НовыйПромокод			 = СуществующиеПромокоды.Добавить();
		НовыйПромокод.Промокод	 = СгенерироватьПромокод(ДлинаПромокода, ГСЧ);
		
	КонецЦикла;
	
	СуществующиеПромокоды.Свернуть("Промокод");
	
	Если СуществующиеПромокоды.Количество() = ТребуемоеКоличествоПромокодов Тогда
		Возврат СуществующиеПромокоды;
	Иначе
		Возврат СгенерироватьПромокоды(ДлинаПромокода, ГСЧ, ТребуемоеКоличествоПромокодов - СуществующиеПромокоды.Количество(), СуществующиеПромокоды);
	КонецЕсли;	
	
КонецФункции

// Функция, возвращает новый промокод.
//
Функция ПолучитьНовыйПромокод(ДлинаПромокода, ГСЧ, СуществующиеПромокоды)
	
	Промокод = СгенерироватьПромокод(ДлинаПромокода, ГСЧ);
	Пока СуществующиеПромокоды.Найти(Промокод) <> Неопределено Цикл
		Промокод = СгенерироватьПромокод(ДлинаПромокода, ГСЧ);
	КонецЦикла;
	
	Возврат Промокод;
	
КонецФункции

// Функция, генерирует промокод.
//
Функция СгенерироватьПромокод(Знач ДлинаПромокода, ГСЧ)
		
	Если ДлинаПромокода = 0 Тогда
		ДлинаПромокода = 10;
	КонецЕсли;	
		
	Буквы = "ABCDEFGHIJKLMNOPQRSTUVWXYZ";
	
	Промокод = "";
	
	Счетчик = 0;
	
	Пока Истина Цикл
		
		Промокод = Промокод + Строка(ГСЧ.СлучайноеЧисло(1, 9));
		Счетчик = Счетчик + 1;
		Если Счетчик >= ДлинаПромокода Тогда
			Прервать;
		КонецЕсли;	
		
		Промокод = Промокод + Сред(Буквы, ГСЧ.СлучайноеЧисло(1, СтрДлина(Буквы)), 1);
		Счетчик = Счетчик + 1;
		Если Счетчик >= ДлинаПромокода Тогда
			Прервать;
		КонецЕсли;
		
		Если Счетчик = 20 Тогда
			Прервать;
		КонецЕсли;	
		
	КонецЦикла;
	
	ПеремешанныйПромокод = "";
	
	Для Индекс = 1 По ДлинаПромокода Цикл
		
		Номер = ГСЧ.СлучайноеЧисло(0, ДлинаПромокода - Индекс) + 1;
		ПеремешанныйПромокод = ПеремешанныйПромокод + Сред(Промокод, Номер, 1);
		Промокод = Сред(Промокод, 1, Номер - 1) + Сред(Промокод, Номер + 1);
		
	КонецЦикла;
	
	Возврат ПеремешанныйПромокод;
	
КонецФункции

// Функция, проверяет уникальность промокода.
//
Функция ПроверитьУникальностьПромокода(Промокод, Вид, Владелец)
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Промокоды.Промокод КАК Промокод
	|ИЗ
	|	РегистрСведений.Промокоды КАК Промокоды
	|ГДЕ
	|	Промокоды.Промокод = &Промокод
	|	И НЕ(Промокоды.Вид = &Вид
	|				И Промокоды.Владелец = &Владелец)");
	
	Запрос.УстановитьПараметр("Промокод", Промокод);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Вид"		, Вид);
			
	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции

// Функция получает реферала по промокоду.
//
Функция ПолучитьРефералаПоПромокоду(Промокод) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Промокоды.Владелец КАК Владелец
	|ИЗ
	|	РегистрСведений.Промокоды КАК Промокоды
	|ГДЕ
	|	Промокоды.Промокод = &Промокод";
	
	Запрос.УстановитьПараметр("Промокод", Промокод);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Результат.Следующий(), Результат.Владелец, Неопределено);
	
КонецФункции
#КонецОбласти
